NakIwan/Training_PSoC_6/ch04_ex01_ble_notify_without_FreeRTOS/main.c
	else if( app_psoc_button_count_2_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
		pressFlagDe = true;

}

cyhal_gpio_callback_data_t app_button_isr_data =
{
	.callback = app_button_isr,
	.callback_arg = NULL
};

int main(void)
{
    cyhal_uart_t uart_obj;
    uint32_t     actualbaud;
    char buffer_text[24];

    cy_rslt_t result ;

    /* Initialize the board support package */
    result = cybsp_init() ;
    if (result != CY_RSLT_SUCCESS)
    {
        CY_ASSERT(0);
    }

    /* Enable global interrupts */
    __enable_irq();

    /* Initialize retarget-io to use the debug UART port */
    cy_retarget_io_init(CYBSP_DEBUG_UART_TX, CYBSP_DEBUG_UART_RX, CY_RETARGET_IO_BAUDRATE);

    result = cyhal_uart_init(&uart_obj, TX_US100, RX_US100, NC, NC, NULL, &uart_config);
    result = cyhal_uart_set_baud(&uart_obj, BAUD_RATE, &actualbaud);

    cyhal_gpio_init(CYBSP_USER_LED,CYHAL_GPIO_DIR_OUTPUT, CYHAL_GPIO_DRIVE_STRONG, CYBSP_LED_STATE_OFF);

    cyhal_gpio_init(P0_4, CYHAL_GPIO_DIR_INPUT, CYHAL_GPIO_DRIVE_PULLUP, CYBSP_BTN_OFF);

    cyhal_gpio_register_callback(P0_4,&app_button_isr_data);
    cyhal_gpio_enable_event(P0_4, CYHAL_GPIO_IRQ_FALL, 7, true);

    printf("**********Application Start*****************\n");

    /* Configure platform specific settings for the BT device */
    cybt_platform_config_init(&cybsp_bt_platform_cfg);

    /* Initialize stack and register the callback function */
    wiced_bt_stack_init (app_bt_management_callback, &wiced_bt_cfg_settings);

    result = cyhal_pwm_init(&PWM_obj, CYBSP_USER_LED2, NULL);
    result = cyhal_pwm_start(&PWM_obj);

    //xTaskCreate (notify_task, "NotifyTask", TASK_STACK_SIZE, NULL, TASK_PRIORITY, &NotifyTaskHandle);

    /* Start the FreeRTOS scheduler */
    vTaskStartScheduler() ;

    /* Should never get here */
//    CY_ASSERT(0) ;
printf("Test\r\n");
    for(;;)
    {
//    	if (P0_4 == 0){
    	cyhal_system_delay_ms(500);
    		printf("test for\r\n");
//    	}
    	if( connection_id )
    	{
    		printf("test3\r\n");
    		if( app_psoc_button_count_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
    		{
    			printf("test4\r\n");
    			if(pressFlagIn){
    				app_psoc_button_count[0]++;
        			printf( "Notify button press count: (%d)\n",
        			app_psoc_button_count[0] );
        			sprintf(buffer_text,"Button Count = %d",app_psoc_button_count[0]);
        			wiced_bt_gatt_server_send_notification( connection_id,
        													HDLC_PSOC_BUTTON_COUNT_VALUE,
        													strlen(buffer_text),
        													(uint8_t *)buffer_text,
        													NULL);
    			}
    		}
    		else if( app_psoc_button_count_2_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION )
    		{
    			if (pressFlagDe){
        			app_psoc_button_count[0]--;
        			printf( "Notify button press count: (%d)\n",
        			app_psoc_button_count[0] );
        			wiced_bt_gatt_server_send_notification( connection_id,
        													HDLC_PSOC_BUTTON_COUNT_2_VALUE,
        													app_psoc_button_count_2_len,
        													app_psoc_button_count,
        													NULL);
    			}
    		}
    		else if(app_psoc_us100_client_char_config[0] & GATT_CLIENT_CONFIG_NOTIFICATION){
				if (cyhal_uart_putc(&uart_obj, 0X55) == CY_RSLT_SUCCESS){
							rx_length = 3;
							cyhal_uart_read(&uart_obj, rx_buf, &rx_length);
							uint16_t data = (uint16)rx_buf[0] << 8 |rx_buf[1];
							sprintf(buffer_text,"US100 = %d\r\n",data);
							wiced_bt_gatt_server_send_notification( connection_id,
																	HDLC_PSOC_US100_VALUE,
																	strlen(buffer_text),
																	(uint8_t *)buffer_text,
																	NULL);
				}
				cyhal_system_delay_ms(1000);
			}
    	}
    }
}

/*******************************************************************************
* Function Name: wiced_bt_dev_status_t app_bt_management_callback(
* 					wiced_bt_management_evt_t event,
* 					wiced_bt_management_evt_data_t *p_event_data )
********************************************************************************/
static wiced_result_t app_bt_management_callback( wiced_bt_management_evt_t event, wiced_bt_management_evt_data_t *p_event_data )
{
	/* Start in error state so that any unimplemented states will return error */
    wiced_result_t result = WICED_BT_ERROR;
    wiced_bt_device_address_t bda = {0};

    printf("Bluetooth Management Event: 0x%x %s\n", event, get_bt_event_name(event));

    switch( event )
    {
		case BTM_ENABLED_EVT:								// Bluetooth Controller and Host Stack Enabled
			if( WICED_BT_SUCCESS == p_event_data->enabled.status )
			{
				printf( "Bluetooth Enabled\n" );

				/* Set the local BDA from the value in the configurator */
				wiced_bt_set_local_bdaddr((uint8_t *)cy_bt_device_address, BLE_ADDR_PUBLIC);
				wiced_bt_dev_read_local_addr( bda );
				printf( "Local Bluetooth® Device Address: ");
				print_bd_address(bda);

				/*Register GATT callback and initialize database*/
				wiced_bt_gatt_register( app_bt_gatt_event_callback );
				wiced_bt_gatt_db_init( gatt_database, gatt_database_len, NULL );

				/*Disable pairing */
				wiced_bt_set_pairable_mode( WICED_TRUE, WICED_FALSE );

				/* Set advertisement packet and begin advertising */
				wiced_bt_ble_set_raw_advertisement_data(CY_BT_ADV_PACKET_DATA_SIZE,
				cy_bt_adv_packet_data);

				wiced_bt_start_advertisements( BTM_BLE_ADVERT_UNDIRECTED_HIGH, 0, NULL );

	            result = WICED_BT_SUCCESS;
			}
			else
			{
				printf( "Failed to initialize Bluetooth controller and stack\n" );
			}
			break;

		case BTM_PAIRING_IO_CAPABILITIES_BLE_REQUEST_EVT: 		// IO capabilities request
			result = WICED_BT_SUCCESS;
			break;

		case BTM_PAIRING_COMPLETE_EVT: 							// Pairing Complete event
			result = WICED_BT_SUCCESS;
			break;

		case BTM_ENCRYPTION_STATUS_EVT: 						// Encryption Status Event
			result = WICED_BT_SUCCESS;
			break;

		case BTM_SECURITY_REQUEST_EVT: 							// Security access
			result = WICED_BT_SUCCESS;
			break;

